demos/dice/docs/Dice.dot
digraph "Dice" {
  rankdir=TB;
  node [shape=box, fontname="monospace"];
  U1 [label="U1\\nNE555"];
  U2 [label="U2\\nCD4017"];
  D1 [label="D1\\nD1N4148"];
  D2 [label="D2\\nD1N4148"];
  D3 [label="D3\\nD1N4148"];
  D4 [label="D4\\nD1N4148"];
  D5 [label="D5\\nD1N4148"];
  D6 [label="D6\\nD1N4148"];
  R1 [label="R1\\n470Ω"];
  R2 [label="R2\\n330Ω"];
  R3 [label="R3\\n330Ω"];
  R4 [label="R4\\n330Ω"];
  R5 [label="R5\\n10000Ω"];
  R6 [label="R6\\n10000Ω"];
  R7 [label="R7\\n10000Ω"];
  C1 [label="C1\\n1e-08F"];
  C2 [label="C2\\n1e-07F"];
  D7 [label="D7\\nred LED"];
  D8 [label="D8\\nred LED"];
  D9 [label="D9\\nred LED"];
  D10 [label="D10\\nred LED"];
  D11 [label="D11\\nred LED"];
  D12 [label="D12\\nred LED"];
  D13 [label="D13\\nred LED"];
  // Nets
  node [shape=circle, label="", width=0.15, fixedsize=true];
  gnd; net_0; net_10; net_2; net_3; net_4; net_6; net_7; net_8; net_9; vcc;
  // Edges (component -- net, taillabel = port name)
  edge [arrowhead=none, fontname="monospace", fontsize=9];
  C1 -> vcc [taillabel="t1"];
  C1 -> vcc [taillabel="t2"];
  C2 -> vcc [taillabel="t1"];
  C2 -> vcc [taillabel="t2"];
  D1 -> net_9 [taillabel="anode"];
  D1 -> net_4 [taillabel="cathode"];
  D10 -> net_2 [taillabel="anode"];
  D10 -> gnd [taillabel="cathode"];
  D11 -> net_2 [taillabel="anode"];
  D11 -> gnd [taillabel="cathode"];
  D12 -> net_0 [taillabel="anode"];
  D12 -> gnd [taillabel="cathode"];
  D13 -> net_0 [taillabel="anode"];
  D13 -> gnd [taillabel="cathode"];
  D2 -> net_6 [taillabel="anode"];
  D2 -> net_4 [taillabel="cathode"];
  D3 -> net_8 [taillabel="anode"];
  D3 -> net_4 [taillabel="cathode"];
  D4 -> net_7 [taillabel="anode"];
  D4 -> net_2 [taillabel="cathode"];
  D5 -> net_6 [taillabel="anode"];
  D5 -> net_2 [taillabel="cathode"];
  D6 -> net_0 [taillabel="anode"];
  D6 -> net_2 [taillabel="cathode"];
  D7 -> net_4 [taillabel="anode"];
  D7 -> gnd [taillabel="cathode"];
  D8 -> net_3 [taillabel="anode"];
  D8 -> gnd [taillabel="cathode"];
  D9 -> net_3 [taillabel="anode"];
  D9 -> gnd [taillabel="cathode"];
  R1 -> net_4 [taillabel="t1"];
  R1 -> net_4 [taillabel="t2"];
  R2 -> net_3 [taillabel="t1"];
  R2 -> net_3 [taillabel="t2"];
  R3 -> net_2 [taillabel="t1"];
  R3 -> net_2 [taillabel="t2"];
  R4 -> net_0 [taillabel="t1"];
  R4 -> net_0 [taillabel="t2"];
  R5 -> vcc [taillabel="t1"];
  R5 -> vcc [taillabel="t2"];
  R6 -> vcc [taillabel="t1"];
  R6 -> vcc [taillabel="t2"];
  R7 -> vcc [taillabel="t1"];
  R7 -> vcc [taillabel="t2"];
  U1 -> gnd [taillabel="GND"];
  U1 -> vcc [taillabel="RESET"];
  U1 -> vcc [taillabel="VCC"];
  U2 -> net_3 [taillabel="CO"];
  U2 -> net_9 [taillabel="Q1"];
  U2 -> net_7 [taillabel="Q2"];
  U2 -> net_6 [taillabel="Q3"];
  U2 -> net_0 [taillabel="Q4"];
  U2 -> net_8 [taillabel="Q5"];
  U2 -> net_10 [taillabel="Q6"];
  U2 -> net_10 [taillabel="RST"];
  U2 -> vcc [taillabel="VDD"];
  U2 -> gnd [taillabel="VSS"];
}
