demos/dice/docs/Dice.mmd
%%{init: {"theme": "neutral"}}%%
flowchart TD
    U1["U1<br/>NE555"]
    U2["U2<br/>CD4017"]
    D1["D1<br/>D1N4148"]
    D2["D2<br/>D1N4148"]
    D3["D3<br/>D1N4148"]
    D4["D4<br/>D1N4148"]
    D5["D5<br/>D1N4148"]
    D6["D6<br/>D1N4148"]
    R1["R1<br/>470Ω"]
    R2["R2<br/>330Ω"]
    R3["R3<br/>330Ω"]
    R4["R4<br/>330Ω"]
    R5["R5<br/>10000Ω"]
    R6["R6<br/>10000Ω"]
    R7["R7<br/>10000Ω"]
    C1["C1<br/>1e-08F"]
    C2["C2<br/>1e-07F"]
    D7["D7<br/>red LED"]
    D8["D8<br/>red LED"]
    D9["D9<br/>red LED"]
    D10["D10<br/>red LED"]
    D11["D11<br/>red LED"]
    D12["D12<br/>red LED"]
    D13["D13<br/>red LED"]
    net_8(("net_8"))
    net_4(("net_4"))
    net_2(("net_2"))
    gnd(("gnd"))
    net_0(("net_0"))
    net_5(("net_5"))
    net_7(("net_7"))
    net_6(("net_6"))
    net_3(("net_3"))
    vcc(("vcc"))
    net_9(("net_9"))
    D1 ---|"anode"| net_8
    D1 ---|"cathode"| net_4
    D10 ---|"anode"| net_2
    D10 ---|"cathode"| gnd
    D11 ---|"anode"| net_2
    D11 ---|"cathode"| gnd
    D12 ---|"anode"| net_0
    D12 ---|"cathode"| gnd
    D13 ---|"anode"| net_0
    D13 ---|"cathode"| gnd
    D2 ---|"anode"| net_5
    D2 ---|"cathode"| net_4
    D3 ---|"anode"| net_7
    D3 ---|"cathode"| net_4
    D4 ---|"anode"| net_6
    D4 ---|"cathode"| net_2
    D5 ---|"anode"| net_5
    D5 ---|"cathode"| net_2
    D6 ---|"anode"| net_0
    D6 ---|"cathode"| net_2
    D7 ---|"anode"| net_4
    D7 ---|"cathode"| gnd
    D8 ---|"anode"| net_3
    D8 ---|"cathode"| gnd
    D9 ---|"anode"| net_3
    D9 ---|"cathode"| gnd
    R1 ---|"t1"| net_4
    R1 ---|"t2"| net_4
    R2 ---|"t1"| net_3
    R2 ---|"t2"| net_3
    R3 ---|"t1"| net_2
    R3 ---|"t2"| net_2
    R4 ---|"t1"| net_0
    R4 ---|"t2"| net_0
    U1 ---|"GND"| gnd
    U1 ---|"RESET"| vcc
    U1 ---|"VCC"| vcc
    U2 ---|"CO"| net_3
    U2 ---|"Q1"| net_8
    U2 ---|"Q2"| net_6
    U2 ---|"Q3"| net_5
    U2 ---|"Q4"| net_0
    U2 ---|"Q5"| net_7
    U2 ---|"Q6"| net_9
    U2 ---|"RST"| net_9
    U2 ---|"VDD"| vcc
    U2 ---|"VSS"| gnd
